'''Задача №3749. Количество различных чисел
Дан список чисел, который может содержать до 100000 чисел.
Определите, сколько в нем встречается различных чисел.'''
print(len(set(input('enter numbers: ').split())))